import { IWeekdays } from "./types";

export const weekdays: IWeekdays[] = ["Пн", "Вт", "Ср", "Чт", "Пт", "Сб", "Вс"];

export const ChildImages = [
  "/child/1 child.png",
  "/child/2 child.png",
  "/child/3 child.png",
  "/child/4 child.png",
  "/child/5 child.png",
  "/child/6 child.png",
];

export const ChildDescriptions = [
  "Привет, юный лидер! Готов взять свою жизнь в свои руки?",
  "Здесь ты сам решаешь, как и когда тебе учиться, заниматься спортом и следить за порядком",
  "Это не скучные уроки и нотации, это игра, где ты сам устанавливаешь правила и сам получаешь награды",
  "Нет криков и ругани, есть понятные “цены” на каждый вид деятельности. Твои усилия не останутся незамеченными: ты получишь честное вознаграждение за свою работу",
  "Ты сам контролируешь свой успех: чем больше ты делаешь, тем больше получаешь. Ты сам учишься быть ответственным и самостоятельным, как настоящий взрослый. Ты сам решаешь, что для тебя важнее: учиться, заниматься спортом или что-то еще",
  "Ты — главный герой своей истории, и только от тебя зависит, какой будет ее концовка. Готов стать хозяином своей жизни? Тогда начни играть!",
];

export const ParentImages = [
  "/parent/1 parent.png",
  "/parent/2 parent.png",
  "/parent/3 parent.png",
  "/parent/4 parent.png",
  "/parent/5 parent.png",
  "/parent/6 parent.png",
];

export const ParentDescriptions = [
  "Ребенок сам решает, учиться или нет",
  "Понятные цены и правила, как в реальном мире",
  "Дети учатся выбирать, как распределить свои усилия",
  "Оценка работы — объективная, не зависит от настроения",
  "Система стимулирует дисциплину и активность",
  "Фокус на результат: Сделал - получил, не сделал - не получил.",
];

export const DocsImage = [
  "/docs/docs_1.png",
  "/docs/docs_2.png",
  "/docs/docs_3.png",
  "/docs/docs_4.png",
  "/docs/docs_5.png",
  "/docs/docs_6.png",
];

export const DocsDescription = [
  "Наше приложение — это не просто инструмент, это партнер в воспитании, который поможет вам перейти от нотаций и принуждения к взрослым и понятным отношениям с вашим ребенком.",
  "Что получает ваш ребенок:<br />✅ Получит свободу выбора, а вместе с ней — ответственность за свои решения.",
  "✅ Научится самостоятельно управлять своим временем и усилиями.<br />✅ Увидит связь между своими действиями и результатом.",
  "✅ Будет мотивирован достижениями, а не страхом наказания.<br />✅ Разовьёт дисциплину, ответственность, финансовую грамотность.",
  "Ваша роль:<br />Мы создали среду, где нет места эмоциям, есть только четкие правила и “цены”, как в реальной жизни. Вы, как родитель, становитесь архитектором этой среды, устанавливаете правила и наблюдаете за ростом вашего ребенка.<br />Вы больше не “полицейский”, а наставник и партнер.",
  "Важный результат:<br />Это ваш шанс воспитать успешного человека, который умеет принимать решения, нести ответственность и добиваться своих целей.<br />Начните строить будущее своего ребенка уже сегодня!",
];
