import { IWeekdays } from "./types";

export const weekdays: IWeekdays[] = ["Пн", "Вт", "Ср", "Чт", "Пт", "Сб", "Вс"];

export const ChildImages = [
  "/child/1 child.png",
  "/child/2 child.png",
  "/child/3 child.png",
  "/child/4 child.png",
  "/child/5 child.png",
  "/child/6 child.png",
];

export const ChildDescriptions = [
  "Привет, юный лидер! Готов взять свою жизнь в свои руки?",
  "Здесь ты сам решаешь, как и когда тебе учиться, заниматься спортом и следить за порядком",
  "Это не скучные уроки и нотации, это игра, где ты сам устанавливаешь правила и сам получаешь награды",
  "Нет криков и ругани, есть понятные “цены” на каждый вид деятельности. Твои усилия не останутся незамеченными: ты получишь честное вознаграждение за свою работу",
  "Ты сам контролируешь свой успех: чем больше ты делаешь, тем больше получаешь. Ты сам учишься быть ответственным и самостоятельным, как настоящий взрослый. Ты сам решаешь, что для тебя важнее: учиться, заниматься спортом или что-то еще",
  "Ты — главный герой своей истории, и только от тебя зависит, какой будет ее концовка. Готов стать хозяином своей жизни? Тогда начни играть!",
];

export const ParentImages = [
  "/parent/1 parent.png",
  "/parent/2 parent.png",
  "/parent/3 parent.png",
  "/parent/4 parent.png",
  "/parent/5 parent.png",
  "/parent/6 parent.png",
];

export const ParentDescriptions = [
  "Ребенок сам решает, учиться или нет",
  "Понятные цены и правила, как в реальном мире",
  "Дети учатся выбирать, как распределить свои усилия",
  "Оценка работы — объективная, не зависит от настроения",
  "Система стимулирует дисциплину и активность",
  "Фокус на результат: Сделал - получил, не сделал - не получил.",
];
